app/controllers/api/v1/links_controller.rb

INSERT INTO "links" ("original_url", "short_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["original_url", "https://google.com"], ["short_url", "28f923e589"], ["created_at", "2023-03-24 12:50:53.404855"], ["updated_at", "2023-03-24 12:50:53.404855"]]
---
  def create
    link = Link.new(link_params)
    if link.save