app/controllers/api/v1/users_controller.rb

    def create
        user = User.new(user_params)
        if user.save!
---
INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at", "api_token") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def get_access_token
        user = User.find_by(email: params[:email])
        if user&.valid_password?(params[:password])
            user.update(api_token: generate_api_token)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "siddushar@gmail.com"], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "api_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2023-03-24 17:01:45.824889"], ["api_token", "[FILTERED]"], ["id", 1]]