app/controllers/links_controller.rb

INSERT INTO "links" ("original_url", "short_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["original_url", "https://www.youtube.com/watch?v=VtzTTy65EMY"], ["short_url", "b22122571d"], ["created_at", "2023-03-24 14:57:33.145555"], ["updated_at", "2023-03-24 14:57:33.145555"]]
---
    def create
      link = Link.new(link_params)
      if link.save

SELECT "links".* FROM "links" WHERE "links"."short_url" = $1 LIMIT $2  [["short_url", "b22122571d"], ["LIMIT", 1]]
---
    def show
      link = Link.find_by(short_url: params[:shorted_url])

SELECT "links".* FROM "links" WHERE "links"."short_url" = $1 LIMIT $2  [["short_url", "b22122571d"], ["LIMIT", 1]]
---
    def shortened
      @link = Link.find_by(short_url: params[:short_url])