app/controllers/concerns/requestable_with_errors.rb

SELECT "users".* FROM "users" WHERE "users"."api_token" = $1 LIMIT $2  [["api_token", "[FILTERED]"], ["LIMIT", 1]]
---
  def authenticate_token!

    @user = User.find_by(api_token: request.headers["Token"])